Revit 2027 API
TessellatedShapeBuilder.Clear Method
 Erases all face set and clears the logs, if any.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Clear()
Public Sub Clear
public:
void Clear()
member Clear : unit -> unit
Remarks
 This function can be safely called upon builder without an open face set.
See Also
Reference
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace